app/Controllers/Artikel.php

public function admin_index()
{
    $title = 'Daftar Artikel (Admin)';

    $model = new ArtikelModel();
    $kategoriModel = new KategoriModel();

    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $page = $this->request->getVar('page') ?? 1;

    $builder = $model->table('artikel')
        ->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }

    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    $artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10

    if ($this->request->isAJAX()) {
        return $this->response->setJSON($data);
    } else {
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

public function add()
{
    $kategoriModel = new KategoriModel();

    $validation = \Config\Services::validation();

    if (strtolower($this->request->getMethod()) === 'post') {

        $validation->setRules([
            'judul' => 'required'
        ]);

      if ($validation->withRequest($this->request)->run()) {


            $file = $this->request->getFile('gambar');

            if ($file && $file->isValid()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            } else {
                $gambar = null;
            }

            $artikel = new ArtikelModel();

           $result = $artikel->insert([
    'judul' => $this->request->getPost('judul'),
    'isi' => $this->request->getPost('isi'),
    'status' => $this->request->getPost('status'),
    'id_kategori' => $this->request->getPost('id_kategori'),
    'slug' => url_title($this->request->getPost('judul')),
    'gambar' => $gambar,
]);
---
INSERT INTO `artikel` (`judul`, `isi`, `status`, `id_kategori`, `slug`, `gambar`) VALUES ('Bahasa Pemrograman', 'Bahasa pemrograman adalah alat utama yang digunakan oleh pengembang untuk memberikan instruksi kepada komputer. Setiap bahasa pemrograman memiliki sintaks dan aturan yang unik, yang membuatnya cocok untuk berbagai jenis aplikasi.\r\n\r\nBeberapa bahasa pemrograman populer seperti Python, JavaScript, dan Java memiliki kelebihan masing-masing, seperti kemudahan penggunaan, fleksibilitas, dan kemampuan untuk membangun aplikasi dari berbagai platform. Memahami berbagai bahasa pemrograman akan membantumu memilih bahasa yang paling sesuai dengan tujuan pengembangan perangkat lunak yang ingin kamu capai.', '1', '2', 'Bahasa-Pemrograman', 'photo-1515879218367-8466d910aaa4_1.jfif')


    $data = [
        'title' => 'Tambah Artikel',
        'kategori' => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`