app/Controllers/Artikel.php

SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
public function admin_index()
{
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();

    $data = [
        'title' => $title,
        'artikel' => $model->paginate(10), // max 10 data per halaman